УНФ_ТЕСТ/src/Catalogs/КП_РолеваяАдресация/КП_РолеваяАдресация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_РолеваяАдресация</name>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.КП_РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.КП_ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.КП_ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_РолеваяАдресация/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование=Справочники.КП_РолеваяАдресация.СформироватьНаименование(Объект);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДекорацияНаименованиеНажатие(Элемент)
	
	Если НЕ ПустаяСтрока(Объект.Наименование) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("Оповещение_ДекорацияНаименованиеНажатиеЗавершение", ЭтотОбъект), НСтр("en='Do you want to form the name?';ru='Сформировать наименование?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ДекорацияНаименованиеНажатиеФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ДекорацияНаименованиеНажатиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса=КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    ДекорацияНаименованиеНажатиеФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНаименованиеНажатиеФрагмент()
    
    СформироватьНаименование();

КонецПроцедуры

&НаСервере 
Процедура СформироватьНаименование()
	
	Объект.Наименование=Справочники.КП_РолеваяАдресация.СформироватьНаименование(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура РольПользователяПриИзменении(Элемент)
	УстановитьТипыПолейАдресации();
КонецПроцедуры

Процедура УстановитьТипыПолейАдресации()
	
	Если НЕ Объект.РольИсполнителя.ТипыОсновногоОбъектаАдресации.Пустая() Тогда
		Элементы.ОсновнойОбъектАдресации.ОграничениеТипа=Объект.РольИсполнителя.ТипыОсновногоОбъектаАдресации.ТипЗначения;
	КонецЕсли;
	
	Если НЕ Объект.РольИсполнителя.ТипыДополнительногоОбъектаАдресации.Пустая() Тогда
		Элементы.ДополнительныйОбъектАдресации.ОграничениеТипа=Объект.РольИсполнителя.ТипыДополнительногоОбъектаАдресации.ТипЗначения;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
